rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_01_Task_Create_Basic/src/main.c
/**
 * ============================================================================
 * PROGRAM 01: Task Create Basic - Pembuatan Task FreeRTOS Dasar
 * ============================================================================
 * 
 * Deskripsi:
 *   Program ini mendemonstrasikan pembuatan task dasar menggunakan FreeRTOS
 *   pada mikrokontroler STM32F103C8 (Blue Pill). Dua task LED blink dibuat
 *   menggunakan xTaskCreate() dengan prioritas berbeda, ditambah satu task
 *   monitor untuk memantau status sistem.
 * 
 * Konsep yang Dipelajari:
 *   1. xTaskCreate()     - Membuat task baru secara dinamis
 *   2. vTaskDelay()      - Menunda eksekusi task (non-blocking)
 *   3. Task Priority     - Pengaruh prioritas terhadap penjadwalan
 *   4. Stack Management  - Pemantauan penggunaan stack
 *   5. Heap Monitoring   - Pemantauan sisa memori heap
 * 
 * Arsitektur Task:
 *   ┌─────────────┐  ┌─────────────┐  ┌──────────────┐
 *   │  Task LED1  │  │  Task LED2  │  │ Task Monitor │
 *   │  Prio: 2    │  │  Prio: 1    │  │  Prio: 3     │
 *   │  PC13 500ms │  │  PB0 200ms  │  │  Status 2s   │
 *   └─────────────┘  └─────────────┘  └──────────────┘
 *         │                │                  │
 *         └────────────────┼──────────────────┘
 *                          │
 *                   ┌──────┴──────┐
 *                   │  Scheduler  │
 *                   │  FreeRTOS   │
 *                   └─────────────┘
 * 
 * Hardware:
 *   - STM32F103C8 Blue Pill (72 MHz, 20KB SRAM)
 *   - LED Built-in: PC13 (active LOW)
 *   - LED Eksternal: PB0 (active HIGH)
 *   - USART1: PA9(TX)/PA10(RX) @ 115200 baud
 * 
 * Output Format (untuk Python parser):
 *   [DATA]TASK,<nama>,<prioritas>,<stack_free>,<toggle_count>,<tick>
 *   [DATA]HEAP,<free_bytes>,<min_free>,<tick>
 *   [DATA]SYSTEM,<task_count>,<uptime_sec>,<tick>
 * 
 * ============================================================================
 */

/* ========================== HEADER INCLUDES ============================== */
#include "stm32f1xx_hal.h"          /* STM32 HAL Library                    */
#include "FreeRTOS.h"               /* Kernel FreeRTOS                      */
#include "task.h"                   /* API Task Management                  */
#include "config.h"                 /* Konfigurasi pin dan parameter        */
#include <stdio.h>                  /* printf, sprintf                      */
#include <string.h>                 /* strlen, memset                       */

/* ======================== VARIABEL GLOBAL ================================ */

/**
 * Handle UART untuk komunikasi serial
 * Digunakan oleh semua task melalui printf (retarget _write)
 */
static UART_HandleTypeDef huart1;

/**
 * Handle task FreeRTOS
 * Disimpan untuk memantau status dan mengambil informasi task
 */
static TaskHandle_t xTask1Handle = NULL;    /* Handle Task LED1 (PC13)      */
static TaskHandle_t xTask2Handle = NULL;    /* Handle Task LED2 (PB0)       */
static TaskHandle_t xMonitorHandle = NULL;  /* Handle Task Monitor          */

/**
 * Counter toggle LED untuk setiap task
 * Volatile karena diakses dari task berbeda
 */
static volatile uint32_t ulTask1ToggleCount = 0;
static volatile uint32_t ulTask2ToggleCount = 0;

/**
 * Flag untuk menandakan scheduler sudah berjalan
 * Digunakan oleh SysTick_Handler untuk memanggil xPortSysTickHandler
 */
static volatile uint8_t ucSchedulerStarted = 0;

/**
 * Nilai heap minimum yang pernah tercatat
 * Berguna untuk mendeteksi kebocoran memori
 */
static volatile uint32_t ulMinFreeHeap = 0xFFFFFFFF;

/**
 * Buffer untuk formatted print output
 */
static char pcPrintBuffer[PRINT_BUFFER_SIZE];

/* ==================== DEKLARASI FUNGSI PROTOTYPE ========================= */

/* Inisialisasi Hardware */
static void SystemClock_Config(void);
static void GPIO_Init(void);
static void UART1_Init(void);

/* Task Functions */
static void vTaskLED1(void *pvParameters);
static void vTaskLED2(void *pvParameters);
static void vTaskMonitor(void *pvParameters);

/* Utility Functions */
static void vPrintSystemInfo(void);
static void vPrintTaskInfo(TaskHandle_t xTask, const char *pcTaskName);
static void vPrintHeapInfo(void);
static void vPrintSeparator(char cChar, uint8_t ucLength);
static const char* pcTaskStateToString(eTaskState eState);

/* ========================= RETARGET PRINTF =============================== */

/**
 * Retarget fungsi _write() ke USART1
 * 
 * Fungsi ini dipanggil oleh printf/sprintf untuk mengirim karakter
 * ke output. Kita arahkan ke UART1 agar bisa dilihat di serial monitor.
 * 
 * @param file  File descriptor (tidak digunakan)
 * @param ptr   Pointer ke buffer data
 * @param len   Jumlah byte yang akan ditulis
 * @return      Jumlah byte yang berhasil ditulis
 */
int _write(int file, char *ptr, int len) {
    (void)file;  /* Parameter tidak digunakan, hindari warning */
    HAL_UART_Transmit(&huart1, (uint8_t*)ptr, len, HAL_MAX_DELAY);
    return len;
}

/* ===================== INTERRUPT HANDLERS ================================ */

/**
 * SysTick Timer Handler
 * 
 * SysTick digunakan bersama oleh HAL (untuk HAL_Delay) dan FreeRTOS
 * (untuk tick scheduling). Handler ini memanggil kedua fungsi:
 * 1. HAL_IncTick()         - Increment counter HAL
 * 2. xPortSysTickHandler() - Tick handler FreeRTOS (hanya jika scheduler aktif)
 * 
 * PENTING: xPortSysTickHandler() TIDAK boleh dipanggil sebelum 
 * vTaskStartScheduler() karena akan menyebabkan crash.
 */
void SysTick_Handler(void) {
    HAL_IncTick();
    
    /* Hanya panggil FreeRTOS tick handler jika scheduler sudah berjalan */
    if (ucSchedulerStarted) {
        xPortSysTickHandler();
    }
}

/* =================== HOOK FUNCTIONS FreeRTOS ============================= */

/**
 * Hook: Malloc Failed
 * 
 * Dipanggil oleh kernel FreeRTOS ketika pvPortMalloc() gagal mengalokasi
 * memori. Biasanya terjadi karena heap penuh.
 * 
 * Aksi: Matikan semua LED, cetak error, dan loop selamanya.
 */
void vApplicationMallocFailedHook(void) {
    /* Matikan semua LED sebagai indikasi error */
    HAL_GPIO_WritePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED_EXT1_PORT, LED_EXT1_PIN, GPIO_PIN_RESET);
    
    printf("\r\n[ERROR] !! MALLOC GAGAL - Heap penuh !!\r\n");
    printf("[ERROR] Free Heap: %lu bytes\r\n", (unsigned long)xPortGetFreeHeapSize());
    
    /* Loop tanpa akhir - sistem harus di-reset */
    taskDISABLE_INTERRUPTS();
    for (;;) {
        /* Blink cepat LED built-in sebagai SOS */
        HAL_GPIO_TogglePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN);
        for (volatile uint32_t i = 0; i < 200000; i++);
    }
}

/**
 * Hook: Stack Overflow
 * 
 * Dipanggil ketika FreeRTOS mendeteksi stack overflow pada suatu task.
 * configCHECK_FOR_STACK_OVERFLOW = 2 menggunakan metode "pattern checking"
 * yang memeriksa apakah pattern di akhir stack masih utuh.
 * 
 * @param xTask      Handle task yang mengalami overflow
 * @param pcTaskName Nama task yang mengalami overflow
 */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    (void)xTask;  /* Hindari warning unused parameter */
    
    printf("\r\n[ERROR] !! STACK OVERFLOW pada task: %s !!\r\n", pcTaskName);
    
    taskDISABLE_INTERRUPTS();
    for (;;) {
        /* Blink pattern khusus: 2 kali cepat, pause */
        HAL_GPIO_WritePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN, GPIO_PIN_RESET);
        for (volatile uint32_t i = 0; i < 100000; i++);
        HAL_GPIO_WritePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN, GPIO_PIN_SET);
        for (volatile uint32_t i = 0; i < 100000; i++);
        HAL_GPIO_WritePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN, GPIO_PIN_RESET);
        for (volatile uint32_t i = 0; i < 100000; i++);
        HAL_GPIO_WritePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN, GPIO_PIN_SET);
        for (volatile uint32_t i = 0; i < 500000; i++);
    }
}

/**
 * Menyediakan memori statis untuk Idle Task
 * 
 * Ketika configSUPPORT_STATIC_ALLOCATION = 1, FreeRTOS memerlukan
 * callback ini untuk mendapatkan buffer memori bagi idle task.
 * Idle task berjalan ketika tidak ada task lain yang siap dieksekusi.
 */
void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer,
                                   StackType_t **ppxIdleTaskStackBuffer,
                                   uint32_t *pulIdleTaskStackSize) {
    /* Buffer statis - dialokasikan sekali, tidak pernah dibebaskan */
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[configMINIMAL_STACK_SIZE];

