rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_01_Task_Create_Basic/src/main.c
    *ppxIdleTaskTCBBuffer   = &xIdleTaskTCB;
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;
    *pulIdleTaskStackSize   = configMINIMAL_STACK_SIZE;
}

/**
 * Menyediakan memori statis untuk Timer Task
 * 
 * Timer task mengelola semua software timer FreeRTOS.
 * Dibutuhkan ketika configUSE_TIMERS = 1 dan 
 * configSUPPORT_STATIC_ALLOCATION = 1.
 */
void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer,
                                    StackType_t **ppxTimerTaskStackBuffer,
                                    uint32_t *pulTimerTaskStackSize) {
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];

    *ppxTimerTaskTCBBuffer   = &xTimerTaskTCB;
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;
    *pulTimerTaskStackSize   = configTIMER_TASK_STACK_DEPTH;
}

/* ==================== KONFIGURASI SYSTEM CLOCK =========================== */

/**
 * Konfigurasi System Clock: HSE 8MHz → PLL x9 → 72 MHz
 * 
 * Diagram Clock Tree:
 *   HSE (8 MHz) ──→ PLL (x9) ──→ SYSCLK (72 MHz)
 *                                    ├──→ AHB  (72 MHz) → HCLK
 *                                    ├──→ APB1 (/2 = 36 MHz)
 *                                    └──→ APB2 (72 MHz)
 * 
 * APB1 max = 36 MHz (untuk USART2, I2C, SPI2, Timer2-7)
 * APB2 max = 72 MHz (untuk USART1, SPI1, GPIO, ADC, Timer1)
 */
static void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /* Konfigurasi oscillator HSE dan PLL */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;           /* Nyalakan HSE 8MHz */
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;  /* Tidak dibagi      */
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;           /* Nyalakan PLL      */
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;    /* Sumber dari HSE   */
    RCC_OscInitStruct.PLL.PLLMUL     = RCC_PLL_MUL9;         /* Kalikan 9x = 72MHz*/

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        /* Jika gagal konfigurasi oscillator, loop error */
        for (;;);
    }

    /* Konfigurasi bus clock (AHB, APB1, APB2) */
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK; /* SYSCLK dari PLL */
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;         /* AHB = 72 MHz    */
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;           /* APB1 = 36 MHz   */
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;           /* APB2 = 72 MHz   */

    /* Flash latency harus 2 wait states untuk 72 MHz */
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
        for (;;);
    }
}

/* ======================== INISIALISASI GPIO ============================== */

/**
 * Inisialisasi GPIO untuk LED dan Tombol
 * 
 * Pin yang dikonfigurasi:
 *   - PC13: LED Built-in (Output Push-Pull, Active LOW)
 *   - PB0:  LED Eksternal 1 (Output Push-Pull, Active HIGH)
 *   - PB1:  LED Eksternal 2 (Output Push-Pull, Active HIGH)
 *   - PA0:  Tombol (Input dengan Pull-Up)
 * 
 * CATATAN: Pada Blue Pill, PC13 memiliki keterbatasan arus (3mA max)
 * karena terhubung melalui resistor ke LED on-board.
 */
static void GPIO_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Aktifkan clock untuk semua port GPIO yang digunakan */
    LED_BUILTIN_CLK_EN();   /* GPIOC untuk LED built-in  */
    LED_EXT1_CLK_EN();      /* GPIOB untuk LED eksternal */
    BTN_CLK_EN();           /* GPIOA untuk tombol        */

    /* ---- Konfigurasi LED Built-in PC13 ---- */
    GPIO_InitStruct.Pin   = LED_BUILTIN_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;     /* Push-Pull output    */
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;     /* Low speed cukup     */
    HAL_GPIO_Init(LED_BUILTIN_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN, GPIO_PIN_SET); /* OFF */

    /* ---- Konfigurasi LED Eksternal PB0 ---- */
    GPIO_InitStruct.Pin   = LED_EXT1_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_EXT1_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_EXT1_PORT, LED_EXT1_PIN, GPIO_PIN_RESET);  /* OFF */

    /* ---- Konfigurasi LED Eksternal PB1 ---- */
    GPIO_InitStruct.Pin   = LED_EXT2_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_EXT2_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_EXT2_PORT, LED_EXT2_PIN, GPIO_PIN_RESET);  /* OFF */

    /* ---- Konfigurasi Tombol PA0 ---- */
    GPIO_InitStruct.Pin  = BTN_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;          /* Mode input          */
    GPIO_InitStruct.Pull = GPIO_PULLUP;              /* Internal pull-up    */
    HAL_GPIO_Init(BTN_PORT, &GPIO_InitStruct);
}

/* ======================== INISIALISASI UART ============================== */

/**
 * Inisialisasi USART1 untuk komunikasi serial
 * 
 * Konfigurasi:
 *   - Baudrate: 115200 bps
 *   - Data bits: 8
 *   - Stop bits: 1
 *   - Parity: None
 *   - Mode: TX dan RX
 *   - Pin: PA9 (TX), PA10 (RX)
 * 
 * USART1 terhubung ke APB2 (72 MHz), sehingga dapat mencapai
 * baudrate tinggi dengan error rendah.
 */
static void UART1_Init(void) {
    /* Aktifkan clock USART1 dan GPIO */
    UART_CLK_EN();
    UART_GPIO_CLK_EN();

    /* Konfigurasi pin TX (PA9) sebagai Alternate Function Push-Pull */
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin   = UART_TX_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;          /* AF Push-Pull       */
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;     /* High speed         */
    HAL_GPIO_Init(UART_TX_PORT, &GPIO_InitStruct);

    /* Konfigurasi pin RX (PA10) sebagai Input Floating */
    GPIO_InitStruct.Pin  = UART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;         /* AF Input           */
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(UART_RX_PORT, &GPIO_InitStruct);

    /* Konfigurasi parameter USART1 */
    huart1.Instance          = UART_INSTANCE;
    huart1.Init.BaudRate     = UART_BAUDRATE;
    huart1.Init.WordLength   = UART_WORDLENGTH_8B;
    huart1.Init.StopBits     = UART_STOPBITS_1;
    huart1.Init.Parity       = UART_PARITY_NONE;
    huart1.Init.Mode         = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&huart1) != HAL_OK) {
        for (;;);
    }
}

/* ========================= UTILITY FUNCTIONS ============================= */

/**
 * Cetak garis pemisah dekoratif
 * @param cChar    Karakter yang digunakan (misalnya '=', '-', '*')
 * @param ucLength Panjang garis (jumlah karakter)
 */
static void vPrintSeparator(char cChar, uint8_t ucLength) {
    for (uint8_t i = 0; i < ucLength; i++) {
        printf("%c", cChar);
    }
    printf("\r\n");
}

/**
 * Konversi state task ke string yang bisa dibaca
 * 
 * State task di FreeRTOS:
 *   - eRunning:   Task sedang berjalan di CPU
 *   - eReady:     Task siap berjalan, menunggu giliran
 *   - eBlocked:   Task menunggu event (delay, semaphore, dll)
 *   - eSuspended: Task di-suspend secara manual
 *   - eDeleted:   Task sudah dihapus, menunggu cleanup
 * 
 * @param eState  State task dari eTaskGetState()
 * @return        String deskripsi state
 */
static const char* pcTaskStateToString(eTaskState eState) {
    switch (eState) {
        case eRunning:   return "RUNNING";
        case eReady:     return "READY";
        case eBlocked:   return "BLOCKED";
        case eSuspended: return "SUSPENDED";
        case eDeleted:   return "DELETED";
        default:         return "UNKNOWN";
    }
}

/**
 * Cetak informasi detail sebuah task
 * 
 * Informasi yang dicetak:
 *   - Nama task
 *   - Prioritas saat ini
 *   - State task (Running/Ready/Blocked/dll)
 *   - High Water Mark (sisa stack minimum yang pernah tersisa)
 * 
 * High Water Mark penting untuk:
 *   - Mendeteksi apakah stack size cukup
 *   - Jika nilainya mendekati 0, stack bisa overflow
 *   - Idealnya minimal 10-20% stack tersisa
 * 
 * @param xTask     Handle task yang akan dicetak infonya
 * @param pcTaskName Nama task untuk display
 */
static void vPrintTaskInfo(TaskHandle_t xTask, const char *pcTaskName) {
    if (xTask == NULL) return;

