rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_01_Task_Create_Basic/src/main.c
    UBaseType_t uxPriority  = uxTaskPriorityGet(xTask);
    eTaskState  eState      = eTaskGetState(xTask);
    UBaseType_t uxHighWater = uxTaskGetStackHighWaterMark(xTask);

    /* Cetak info yang bisa dibaca manusia */
    printf("  %-15s | Prio: %lu | State: %-10s | Stack Free: %lu words\r\n",
           pcTaskName,
           (unsigned long)uxPriority,
           pcTaskStateToString(eState),
           (unsigned long)uxHighWater);

    /* Cetak data format untuk Python parser */
    printf("[DATA]TASK,%s,%lu,%lu,%lu,%lu\r\n",
           pcTaskName,
           (unsigned long)uxPriority,
           (unsigned long)uxHighWater,
           (pcTaskName[5] == 'L' && pcTaskName[9] == '1') ? 
               (unsigned long)ulTask1ToggleCount : (unsigned long)ulTask2ToggleCount,
           (unsigned long)xTaskGetTickCount());
    
    /* Peringatan jika stack hampir habis */
    if (uxHighWater < 20) {
        printf("  [PERINGATAN] Stack %s hampir habis! (%lu words tersisa)\r\n",
               pcTaskName, (unsigned long)uxHighWater);
    }
}

/**
 * Cetak informasi penggunaan heap FreeRTOS
 * 
 * Heap FreeRTOS (10KB) digunakan untuk:
 *   - TCB (Task Control Block) setiap task
 *   - Stack setiap task
 *   - Queue, Semaphore, dll (jika ada)
 * 
 * Memantau heap penting untuk:
 *   - Memastikan masih ada ruang untuk alokasi baru
 *   - Mendeteksi memory leak
 */
static void vPrintHeapInfo(void) {
    uint32_t ulFreeHeap = (uint32_t)xPortGetFreeHeapSize();
    
    /* Update minimum heap yang pernah tercatat */
    if (ulFreeHeap < ulMinFreeHeap) {
        ulMinFreeHeap = ulFreeHeap;
    }

    uint32_t ulUsedHeap = configTOTAL_HEAP_SIZE - ulFreeHeap;
    uint32_t ulUsagePercent = (ulUsedHeap * 100) / configTOTAL_HEAP_SIZE;

    printf("\r\n  === Informasi Heap FreeRTOS ===\r\n");
    printf("  Total Heap   : %u bytes\r\n", (unsigned int)configTOTAL_HEAP_SIZE);
    printf("  Digunakan    : %lu bytes (%lu%%)\r\n", 
           (unsigned long)ulUsedHeap, (unsigned long)ulUsagePercent);
    printf("  Tersisa      : %lu bytes\r\n", (unsigned long)ulFreeHeap);
    printf("  Minimum      : %lu bytes (pernah tercatat)\r\n", 
           (unsigned long)ulMinFreeHeap);

    /* Output format untuk Python parser */
    printf("[DATA]HEAP,%lu,%lu,%lu\r\n",
           (unsigned long)ulFreeHeap,
           (unsigned long)ulMinFreeHeap,
           (unsigned long)xTaskGetTickCount());
    
    /* Peringatan jika heap hampir habis */
    if (ulUsagePercent > 90) {
        printf("  [PERINGATAN] Heap usage > 90%%! Hati-hati alokasi baru.\r\n");
    }
}

/**
 * Cetak informasi sistem secara keseluruhan
 * 
 * Termasuk:
 *   - Jumlah task yang ada
 *   - Uptime sistem
 *   - Status setiap task
 *   - Penggunaan heap
 */
static void vPrintSystemInfo(void) {
    TickType_t xCurrentTick = xTaskGetTickCount();
    uint32_t ulUptimeSec = xCurrentTick / configTICK_RATE_HZ;
    UBaseType_t uxTaskCount = uxTaskGetNumberOfTasks();

    vPrintSeparator('=', 65);
    printf("  MONITOR SISTEM - FreeRTOS Task Basic\r\n");
    printf("  Uptime: %lu detik | Tick: %lu | Jumlah Task: %lu\r\n",
           (unsigned long)ulUptimeSec,
           (unsigned long)xCurrentTick,
           (unsigned long)uxTaskCount);
    vPrintSeparator('-', 65);

    /* Cetak info setiap task */
    printf("\r\n  --- Status Task ---\r\n");
    vPrintTaskInfo(xTask1Handle, TASK1_NAME);
    vPrintTaskInfo(xTask2Handle, TASK2_NAME);
    vPrintTaskInfo(xMonitorHandle, MONITOR_TASK_NAME);

    /* Cetak toggle count */
    printf("\r\n  --- Counter Toggle LED ---\r\n");
    printf("  Task LED1 (PC13): %lu toggle\r\n", (unsigned long)ulTask1ToggleCount);
    printf("  Task LED2 (PB0) : %lu toggle\r\n", (unsigned long)ulTask2ToggleCount);

    /* Cetak heap info */
    vPrintHeapInfo();

    /* Data sistem untuk Python parser */
    printf("[DATA]SYSTEM,%lu,%lu,%lu\r\n",
           (unsigned long)uxTaskCount,
           (unsigned long)ulUptimeSec,
           (unsigned long)xCurrentTick);

    vPrintSeparator('=', 65);
}

/* ========================== TASK FUNCTIONS =============================== */

/**
 * Task LED1: Blink LED Built-in PC13 setiap 500ms
 * 
 * Task ini mendemonstrasikan:
 *   1. Penggunaan vTaskDelay() untuk timing periodik
 *   2. Toggle GPIO menggunakan HAL
 *   3. Pelaporan status via UART
 * 
 * Prioritas: 2 (sedang)
 * Stack: 256 words (1024 bytes)
 * 
 * Catatan tentang vTaskDelay():
 *   - Menempatkan task ke state BLOCKED selama waktu tertentu
 *   - Selama blocked, CPU bisa menjalankan task lain
 *   - Waktu dihitung dari saat vTaskDelay dipanggil
 *   - Tidak cocok untuk timing presisi (lihat vTaskDelayUntil)
 * 
 * @param pvParameters  Parameter yang diteruskan saat xTaskCreate (NULL)
 */
static void vTaskLED1(void *pvParameters) {
    (void)pvParameters;  /* Tidak menggunakan parameter */

    /* Variabel lokal task - setiap task punya stack sendiri */
    TickType_t xLastPrintTick = 0;
    const TickType_t xPrintInterval = pdMS_TO_TICKS(2000); /* Print tiap 2 detik */

    printf("[%s] Task dimulai - LED PC13 blink %d ms, Prioritas %d\r\n",
           TASK1_NAME, TASK1_BLINK_PERIOD_MS, TASK1_PRIORITY);

    /* ---- Loop utama task (berjalan selamanya) ---- */
    for (;;) {
        /* Toggle LED built-in PC13 */
        LED_BUILTIN_TOGGLE();
        ulTask1ToggleCount++;

        /* Cetak status periodik (tidak setiap toggle, hemat bandwidth) */
        TickType_t xCurrentTick = xTaskGetTickCount();
        if ((xCurrentTick - xLastPrintTick) >= xPrintInterval) {
            xLastPrintTick = xCurrentTick;

            UBaseType_t uxHighWater = uxTaskGetStackHighWaterMark(NULL);
            printf("[%s] Toggle #%lu | Stack free: %lu words | Tick: %lu\r\n",
                   TASK1_NAME,
                   (unsigned long)ulTask1ToggleCount,
                   (unsigned long)uxHighWater,
                   (unsigned long)xCurrentTick);

            /* Data untuk Python parser */
            printf("[DATA]TASK,%s,%d,%lu,%lu,%lu\r\n",
                   TASK1_NAME,
                   TASK1_PRIORITY,
                   (unsigned long)uxHighWater,
                   (unsigned long)ulTask1ToggleCount,
                   (unsigned long)xCurrentTick);
        }

        /* Delay 500ms - task masuk state BLOCKED */
        vTaskDelay(pdMS_TO_TICKS(TASK1_BLINK_PERIOD_MS));
    }
}

/**
 * Task LED2: Blink LED Eksternal PB0 setiap 200ms
 * 
 * Task ini berjalan bersamaan (concurrent) dengan Task LED1.
 * Karena prioritasnya lebih rendah (1 < 2), task ini hanya
 * berjalan ketika Task LED1 sedang dalam state BLOCKED.
 * 
 * Dalam praktiknya, kedua task tampak berjalan "bersamaan"
 * karena switching terjadi sangat cepat (< 1ms).
 * 
 * Prioritas: 1 (rendah)
 * Stack: 256 words (1024 bytes)
 * 
 * @param pvParameters  Parameter yang diteruskan saat xTaskCreate (NULL)
 */
static void vTaskLED2(void *pvParameters) {
    (void)pvParameters;

    TickType_t xLastPrintTick = 0;
    const TickType_t xPrintInterval = pdMS_TO_TICKS(2000);

