rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_01_Task_Create_Basic/src/main.c
    printf("[%s] Task dimulai - LED PB0 blink %d ms, Prioritas %d\r\n",
           TASK2_NAME, TASK2_BLINK_PERIOD_MS, TASK2_PRIORITY);

    for (;;) {
        /* Toggle LED eksternal PB0 */
        LED_EXT1_TOGGLE();
        ulTask2ToggleCount++;

        /* Cetak status periodik */
        TickType_t xCurrentTick = xTaskGetTickCount();
        if ((xCurrentTick - xLastPrintTick) >= xPrintInterval) {
            xLastPrintTick = xCurrentTick;

            UBaseType_t uxHighWater = uxTaskGetStackHighWaterMark(NULL);
            printf("[%s] Toggle #%lu | Stack free: %lu words | Tick: %lu\r\n",
                   TASK2_NAME,
                   (unsigned long)ulTask2ToggleCount,
                   (unsigned long)uxHighWater,
                   (unsigned long)xCurrentTick);

            printf("[DATA]TASK,%s,%d,%lu,%lu,%lu\r\n",
                   TASK2_NAME,
                   TASK2_PRIORITY,
                   (unsigned long)uxHighWater,
                   (unsigned long)ulTask2ToggleCount,
                   (unsigned long)xCurrentTick);
        }

        /* Delay 200ms - task masuk state BLOCKED */
        vTaskDelay(pdMS_TO_TICKS(TASK2_BLINK_PERIOD_MS));
    }
}

/**
 * Task Monitor: Memantau dan mencetak status seluruh sistem
 * 
 * Task ini memiliki prioritas tertinggi (3) agar selalu bisa
 * mengambil alih CPU untuk mencetak laporan status.
 * 
 * Fungsi utama:
 *   1. Mencetak status semua task (nama, prioritas, state, stack)
 *   2. Mencetak penggunaan heap
 *   3. Mencetak jumlah toggle setiap LED
 *   4. Membaca status tombol (PA0)
 * 
 * Prioritas: 3 (tinggi)
 * Stack: 512 words (2048 bytes) - lebih besar karena banyak printf
 * 
 * @param pvParameters  Parameter yang diteruskan saat xTaskCreate (NULL)
 */
static void vTaskMonitor(void *pvParameters) {
    (void)pvParameters;

    uint32_t ulCycleCount = 0;

    printf("[%s] Task monitor dimulai - Period %d ms, Prioritas %d\r\n",
           MONITOR_TASK_NAME, MONITOR_PERIOD_MS, MONITOR_PRIORITY);

    for (;;) {
        ulCycleCount++;

        /* Cetak header cycle */
        printf("\r\n");
        printf(">>> Monitor Cycle #%lu <<<\r\n", (unsigned long)ulCycleCount);

        /* Cetak informasi sistem lengkap */
        vPrintSystemInfo();

        /* Baca status tombol */
        GPIO_PinState btnState = HAL_GPIO_ReadPin(BTN_PORT, BTN_PIN);
        printf("  Tombol PA0: %s\r\n", 
               (btnState == GPIO_PIN_RESET) ? "DITEKAN" : "DILEPAS");

        /* Toggle LED PB1 sebagai indikator monitor aktif */
        HAL_GPIO_TogglePin(LED_EXT2_PORT, LED_EXT2_PIN);

        /* Gunakan vTaskList untuk daftar task lengkap (jika tersedia) */
        if (ulCycleCount % 5 == 0) {
            /* Setiap 5 cycle, cetak tabel task detail */
            printf("\r\n  === Tabel Task FreeRTOS (vTaskList) ===\r\n");
            printf("  %-16s %-8s %-6s %-8s %-6s\r\n",
                   "Nama", "State", "Prio", "Stack", "Num");
            vPrintSeparator('-', 55);

            /* 
             * vTaskList menghasilkan tabel ASCII dari semua task
             * Format: Nama\tState\tPriority\tStack\tNum
             * State: X=Running, R=Ready, B=Blocked, S=Suspended, D=Deleted
             */
            char pcTaskListBuffer[512];
            vTaskList(pcTaskListBuffer);
            printf("%s\r\n", pcTaskListBuffer);
        }

        /* Delay 2 detik sebelum cycle berikutnya */
        vTaskDelay(pdMS_TO_TICKS(MONITOR_PERIOD_MS));
    }
}

/* ============================ MAIN FUNCTION ============================== */

/**
 * Fungsi Utama Program
 * 
 * Urutan inisialisasi:
 *   1. HAL_Init()          - Inisialisasi HAL, SysTick, Flash prefetch
 *   2. SystemClock_Config() - Konfigurasi clock 72 MHz
 *   3. GPIO_Init()          - Konfigurasi pin LED dan tombol
 *   4. UART1_Init()         - Konfigurasi USART1 115200 baud
 *   5. xTaskCreate()        - Buat semua task FreeRTOS
 *   6. vTaskStartScheduler() - Mulai scheduler (tidak pernah return)
 * 
 * PENTING: Setelah vTaskStartScheduler(), kontrol sepenuhnya
 * diberikan ke kernel FreeRTOS. Kode setelahnya hanya dieksekusi
 * jika scheduler gagal dimulai (biasanya karena heap tidak cukup).
 */
int main(void) {
    /* ---- Fase 1: Inisialisasi Hardware ---- */
    HAL_Init();
    SystemClock_Config();
    GPIO_Init();
    UART1_Init();

    /* ---- Fase 2: Banner Startup ---- */
    printf("\r\n\r\n");
    vPrintSeparator('*', 65);
    printf("*   STM32F103 FreeRTOS - Program 01: Task Create Basic        *\r\n");
    printf("*   Demonstrasi pembuatan task dasar dengan xTaskCreate()      *\r\n");
    vPrintSeparator('*', 65);
    printf("\r\n");

    /* Cetak informasi sistem */
    printf("  [INFO] System Clock  : %lu MHz\r\n", 
           (unsigned long)(HAL_RCC_GetSysClockFreq() / 1000000));
    printf("  [INFO] AHB Clock     : %lu MHz\r\n", 
           (unsigned long)(HAL_RCC_GetHCLKFreq() / 1000000));
    printf("  [INFO] APB1 Clock    : %lu MHz\r\n", 
           (unsigned long)(HAL_RCC_GetPCLK1Freq() / 1000000));
    printf("  [INFO] APB2 Clock    : %lu MHz\r\n", 
           (unsigned long)(HAL_RCC_GetPCLK2Freq() / 1000000));
    printf("  [INFO] FreeRTOS Heap : %u bytes\r\n", 
           (unsigned int)configTOTAL_HEAP_SIZE);
    printf("  [INFO] Tick Rate     : %u Hz\r\n", 
           (unsigned int)configTICK_RATE_HZ);
    printf("\r\n");

    /* Cetak heap sebelum pembuatan task */
    printf("  [HEAP] Sebelum pembuatan task:\r\n");
    printf("  [HEAP] Free: %lu bytes\r\n\r\n", 
           (unsigned long)xPortGetFreeHeapSize());

    /* ---- Fase 3: Pembuatan Task FreeRTOS ---- */
    printf("  Membuat task FreeRTOS...\r\n\r\n");

    BaseType_t xResult;

    /**
     * xTaskCreate() - Membuat task baru secara dinamis
     * 
     * Parameter:
     *   1. pvTaskCode   - Pointer ke fungsi task
     *   2. pcName       - Nama task (untuk debugging, max configMAX_TASK_NAME_LEN)
     *   3. usStackDepth - Ukuran stack dalam words (bukan bytes!)
     *   4. pvParameters - Parameter yang diteruskan ke fungsi task (void*)
     *   5. uxPriority   - Prioritas task (0 = terendah)
     *   6. pxCreatedTask- Pointer untuk menyimpan handle task
     * 
     * Return: pdPASS jika berhasil, errCOULD_NOT_ALLOCATE_REQUIRED_MEMORY jika gagal
     */

    /* Buat Task LED1 - Blink PC13 */
    xResult = xTaskCreate(
        vTaskLED1,              /* Fungsi task                           */
        TASK1_NAME,             /* Nama task: "Task_LED1"                */
        TASK1_STACK_SIZE,       /* Stack: 256 words = 1024 bytes         */
        NULL,                   /* Tidak ada parameter                   */
        TASK1_PRIORITY,         /* Prioritas: 2                          */
        &xTask1Handle           /* Simpan handle untuk monitoring        */
    );

    if (xResult == pdPASS) {
        printf("  [OK] Task '%s' berhasil dibuat (Prio: %d, Stack: %d words)\r\n",
               TASK1_NAME, TASK1_PRIORITY, TASK1_STACK_SIZE);
    } else {
        printf("  [GAGAL] Task '%s' gagal dibuat! Error: %ld\r\n",
               TASK1_NAME, (long)xResult);
    }

