rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_01_Task_Create_Basic/src/main.c
    /* Buat Task LED2 - Blink PB0 */
    xResult = xTaskCreate(
        vTaskLED2,
        TASK2_NAME,
        TASK2_STACK_SIZE,
        NULL,
        TASK2_PRIORITY,
        &xTask2Handle
    );

    if (xResult == pdPASS) {
        printf("  [OK] Task '%s' berhasil dibuat (Prio: %d, Stack: %d words)\r\n",
               TASK2_NAME, TASK2_PRIORITY, TASK2_STACK_SIZE);
    } else {
        printf("  [GAGAL] Task '%s' gagal dibuat! Error: %ld\r\n",
               TASK2_NAME, (long)xResult);
    }

    /* Buat Task Monitor - Pemantau sistem */
    xResult = xTaskCreate(
        vTaskMonitor,
        MONITOR_TASK_NAME,
        MONITOR_STACK_SIZE,
        NULL,
        MONITOR_PRIORITY,
        &xMonitorHandle
    );

    if (xResult == pdPASS) {
        printf("  [OK] Task '%s' berhasil dibuat (Prio: %d, Stack: %d words)\r\n",
               MONITOR_TASK_NAME, MONITOR_PRIORITY, MONITOR_STACK_SIZE);
    } else {
        printf("  [GAGAL] Task '%s' gagal dibuat! Error: %ld\r\n",
               MONITOR_TASK_NAME, (long)xResult);
    }

    /* Cetak heap setelah pembuatan task */
    printf("\r\n  [HEAP] Setelah pembuatan task:\r\n");
    printf("  [HEAP] Free: %lu bytes\r\n", 
           (unsigned long)xPortGetFreeHeapSize());
    printf("  [HEAP] Digunakan untuk task: %lu bytes\r\n\r\n",
           (unsigned long)(configTOTAL_HEAP_SIZE - xPortGetFreeHeapSize()));

    /* ---- Fase 4: Mulai Scheduler FreeRTOS ---- */
    printf("  Memulai FreeRTOS Scheduler...\r\n");
    printf("  ================================================\r\n\r\n");

    /* Set flag sebelum memulai scheduler */
    ucSchedulerStarted = 1;

    /**
     * vTaskStartScheduler() - Memulai kernel FreeRTOS
     * 
     * Setelah fungsi ini dipanggil:
     *   - Idle task dibuat secara otomatis (prioritas 0)
     *   - Timer task dibuat jika configUSE_TIMERS = 1
     *   - Task dengan prioritas tertinggi mulai berjalan
     *   - Fungsi ini TIDAK PERNAH return (dalam kondisi normal)
     * 
     * Jika return, berarti ada masalah fatal:
     *   - Tidak cukup heap untuk idle task
     *   - Tidak cukup heap untuk timer task
     */
    vTaskStartScheduler();

    /* ---- Kode ini hanya dieksekusi jika scheduler gagal ---- */
    printf("\r\n[FATAL] Scheduler gagal dimulai! Heap tidak cukup?\r\n");
    printf("[FATAL] Free Heap: %lu bytes\r\n", (unsigned long)xPortGetFreeHeapSize());

    /* Loop error - blink LED sangat cepat */
    for (;;) {
        HAL_GPIO_TogglePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN);
        HAL_Delay(50);
    }
}

/* ====================== HAL CALLBACK OVERRIDES =========================== */

/**
 * HAL MSP Init - Dipanggil oleh HAL_Init()
 * Melakukan inisialisasi level rendah yang diperlukan HAL
 */
void HAL_MspInit(void) {
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_RCC_PWR_CLK_ENABLE();

    /* Disable JTAG, enable SWD (membebaskan PB3, PB4, PA15) */
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
}
